{
  "general": {
    "save": "Save",
    "saveChanges": "Save changes",
    "unsavedChanges": "Unsaved changes",
    "discardChanges": "Discard changes",
    "cancel": "Cancel",
    "submit": "Submit",
    "yes": "Yes",
    "no": "No",
    "ok": "Ok",
    "copy": "Copy",
    "confirm": "Confirm",
    "enable": "Enable",
    "disable": "Disable",
    "add": "Add",
    "edit": "Edit",
    "delete": "Delete",
    "discard": "Discard",
    "disconnect": "Disconnect",
    "any": "ANY",
    "at": "at",
    "clear": "Clear",
    "learnMore": "Learn more",
    "apply": "Apply",
    "search": "Search...",
    "settings": "Settings",
    "viewDetails": "View details",
    "changesSaved": "Changes saved successfully.",
    "notApplicable": "N/A",
    "errors": {
      "InvalidOperationException": "An error occurred on the server side. Please check the data and try again.",
      "unknown": "An unknown error occurred. Please try again later.",
      "saveEntityFailed": "Failed to save entity because %s",
      "getEntityFailed": "Failed to retrieve entity because %s",
      "failedToRetrieveStores": "Failed to retrieve stores.",
      "failedToRetrieveOrderStatuses": "Failed to retrieve order statuses.",
      "general": {
        "unhandled": "An error occurred. Please check all inputs and try again."
      },
      "stores": {
        "invalidIdAndStatus": "Status Id and status name are invalid."
      },
      "connection": {
        "emptyStoreId": "Empty store id.",
        "invalidMode": "Invalid mode.",
        "emptyData": "Empty connection data.",
        "settingsNotFound": "Connection settings not found.",
        "invalidSettings": "Connection settings are not valid.",
        "credentialsDoNotExist": "Api credential details do not exist.",
        "testKeyChanged": "Test api key has been changed.",
        "liveKeyChanged": "Live api key has been changed.",
        "invalidKey": "Api key is not valid.",
        "originFailed": "Adding allowed origin failed"
      }
    },
    "selectedItems": "%s items selected",
    "login": "Login"
  },
  "credentials": {
    "title": "Credentials",
    "notificationsDescription": "You can find registrated webhook for your store here.",
    "description": "Here is the list of available payment methods for your merchant account. You can enable the payment method in your store by clicking on the toggle button.",
    "saveChanges": "Save changes",
    "disconnect": "Disconnect",
    "notifications": "Notifications",
    "registrationDate": "Registration Date",
    "webhook": "Webhooks IDs",
    "webhookUrl": "Webhooks URLs",
    "event": "Events",
    "reRegister": "Re-register webhook",
    "disconnectWarning": "Are you sure you want to disconnect store?",
    "saveChangesWarning": "The environment change has been detected. Do you want to use the same configuration?",
    "webhookRegistered": "Webhooks are successfully registered!",
    "webhookUnsuccessful": "Webhook registration failed!"
  },
  "footer": {
    "support": "Need help?",
    "version": "Version: %s",
    "update": "(New version is available <a href = ''>here</a>)",
    "supportLink": "https://help.unzer.com/kb/en/"
  },
  "login": {
    "sandbox": "You’re currently in the Sandbox environment. Switch to live mode <a href='%s'>here</a>.",
    "heading": {
      "title": "UnzerOne: </br>One platform for all channels and the ideal customer experience.",
      "subtitle": "Make sure that you’re logged in the merchant portal because you need to copy several settings from there to fill in the following information. If you don’t have an account, contact us <a href='https://www.unzer.com/en/sales-team-contact/' target='_blank'>here</a>."
    },
    "environment": {
      "title": "Environment",
      "live": "Live",
      "sandbox": "Sandbox"
    },
    "credentials": {
      "header": "Credentials (%s)",
      "title": "Credentials",
      "description": "You can find your API credentials in merchant portal.",
      "label": "Credentials",
      "public": "Enter Public Key",
      "private": "Enter Private Key"
    },
    "description": {
      "title": "All payment methods, 160 countries, all currencies",
      "subtitle": "Attract shoppers from across the globe. Allow them to choose from 200 national and international payment methods. Whether in your online shop or your business. Regardless of currency. All easy and affordable for you."
    }
  },
  "design": {
    "heading": {
      "title": "Payment Page Design Settings",
      "description": "Here is the list of available payment methods for your merchant account. You can enable the payment method in your store by clicking on the toggle button.",
      "saveLabel": "Save changes",
      "previewLabel": "Preview"
    },
    "translations": {
      "title": "Styling & Customizations",
      "shopName": "Shop name",
      "shopNameDescription": "The shops name to be displayed on the paypage.",
      "shopTagline": "Shop tagline",
      "shopTaglineDescription": "A short description about your shop.",
      "contactUrl": "Contact URL",
      "contactUrlDescription": "Hint.",
      "terms": "Terms and conditions link",
      "termsDescription": "A link to your shops terms and conditions. The link will be displayed within the payment page.",
      "shopDescription": "Shop description",
      "shopDescriptionDescription": "The shop description to be displayed on the paypage.",
      "helpLink": "Help link",
      "helpLinkDescription": "A link to your shops help page. The link will be displayed within the payment page.",
      "privacyPolicy": "Privacy policy URL",
      "privacyPolicyDescription": "A link to your shops privacy policy. The link will be displayed within the payment page.",
      "headerColor": "Header background color",
      "headerColorDescription": "The header background color.",
      "steplineColor": "Stepline color",
      "steplineColorDescription": "The stepline color.",
      "orderColor": "Order ID color",
      "orderColorDescription": "The order ID color",
      "shopDescriptionColor": "Shop description font color",
      "shopDescriptionColorDescription": "The shop description font color.",
      "helpLinkColor": "Help link font color",
      "helpLinkColorDescription": "The help link font color.",
      "headerFontColor": "Header font color",
      "headerFontColorDescription": "The header font color.",
      "invoiceColor": "Invoice ID font color",
      "invoiceColorDescription": "The invoice ID font color.",
      "shopNameColor": "Shop name font color",
      "shopNameColorDescription": "The shop name font color",
      "shopNameBackground": "Shop name background color",
      "shopNameBackgroundDescription": "The shop name background color",
      "shopTaglineColor": "Shop tagline font color",
      "shopTaglineColorDescription": "The shop tagline font color.",
      "shopTaglineBackgroundColor": "Shop tagline background color",
      "shopTaglineBackgroundColorDescription": "The shop tagline background color.",
      "contactLinkColor": "Contact link font color",
      "contactLinkColorDescription": "The contact link font color.",
      "fullPageImage": "Fullpage image URL",
      "fullPageImageDescription": "A custom background image for the paypage.",
      "logoImageUrl": "Logo image URL",
      "logoImageUrlDescription": "A logo image of your shop for the paypage."
    }
  },
  "checkout": {
    "page": {
      "title": "Checkout Settings",
      "description": "In this section, you can set up and customize the Unzer payment method for use during the checkout process. This allows you to offer a seamless and secure payment option for your customers.",
      "paymentMethodTitle": "Payment Methods",
      "paymentMethodDescription": "Here is the list of available payment methods for your merchant account. You can enable the payment method in your store by clicking on the toggle button.",
      "settings" : "Payment page settings",
      "configurationSaved" : "Configuration is saved successfully",
      "enabled": "Payment method %s is enabled!",
      "disabled": "Payment method %s is disabled!"
    },
    "modal": {
      "method": "Booking method",
      "methodDescription": "You can initialize the payment page to support either charge or authorize transactions. Most of the <a href=''>payment methods support charge transaction</a>.",
      "minAmount": "Min order amount",
      "maxAmount": "Max order amount",
      "surcharge": "Surcharge",
      "surchargeDescription": "Specify an additional fee applied to this payment method.",
      "restrictCountries": "Restrict to specific countries",
      "restrictCountriesDescription": "Select the countries where this payment method should be available.",
      "basketData": "Enable sending basket",
      "basketDataDescription": "If enabled, the basket data will always be sent.",
      "chargeTitle": "Charge on status changed",
      "chargeDescription": "Select the status that will trigger the payment capture."
    },
    "fields": {
      "paymentMethodName": {
        "label": "Payment method name",
        "description": "The Unzer payment method name on the checkout."
      },
      "paymentMethodDescription": {
        "label": "Payment method description",
        "description": "The Unzer payment method description on the checkout."
      },
      "pageType": {
        "label": "Page type",
        "description": "Choose between Embedded Payment Page (EPP) and Hosted Payment Page (HPP)."
      },
      "enablePayment": {
        "label": "Enable Unzer payment method",
        "description": "Activate Unzer payment method on checkout."
      },
      "displayPaymentLogo": {
        "label": "Display payment logos on the checkout",
        "description": "Display Unzer payment logos on the checkout."
      },
      "displayUnzerLogo": {
        "label": "Display Unzer logos on the checkout",
        "description": "Display Unzer payment logos on the checkout."
      }
    }
  },
  "paymentMethods": {
    "alipay": "Alipay, the payment method from China’s Alibaba, is the most used online payment method in China. When your customer chooses to pay with Alipay, they are redirected to an Alipay payment page where they can sign in to their account or conveniently pay by scanning a unique QR code.",
    "applepay": "Apple Pay is a mobile wallet solution available to all users of Apple devices.",
    "bancontact": "Bancontact is the most popular online payment method in Belgium, with over 15 million cards in circulation. Customers use a Bancontact card or mobile app linked to a Belgian bank account to pay online. Once they select Bancontact as a payment method, they are redirected to their bank portal to enter their credentials and make the payment. The result of the payment is reflected immediately because the money is debited immediately.",
    "card": "Cards can be differentiated in credit and debit cards. In most cases they are issued by banks (Issuers) in cooperation with card organizations (schemes) such as Mastercard, VISA, Diners, or American Express. Based on those schemes, payment acceptance is possible almost worldwide online and offline.",
    "eps": "Electronic Payment Standard (EPS) is a popular online payment method available in Austria. As with other redirect payment methods, when the customer selects their bank or specifies a BIC, they are redirected to their bank payment site to make the payment. Once the authentication and payment is done, they can be redirected back to your online shop.",
    "giropay": "Giropay is one of the most popular online payment methods available in Germany. As with other redirect payment methods, when the customer selects their bank or specifies a BIC, they are redirected to their bank payment site to make the payment. Once the authentication and payment is done, they can be redirected back to your online shop.",
    "ideal": "iDEAL is one of the most popular online payment methods in the Netherlands. It generates a SEPA Credit Transfer from within the consumer’s trusted online banking portal. By using iDEAL, consumers are able to pay for their online purchases in a user-friendly, cost-efficient, and safe way. iDEAL supports the SEPA transfers mainly through Dutch banks.",
    "klarna": "Klarna is a payment method that provides an easy to use pay later payment option. Your customers can buy the goods now and choose to pay at a later date. Once the customer selects Klarna for making the payment, they are redirected to a Klarna payment page, where they need to login to confirm their details and finalize the purchase.",
    "twint": "With TWINT, you can make convenient and secure payments with your smartphone – at the cash register in a supermarket, in an online shop, when shopping at a farm shop, on public transport, when parking, or when transferring money to your friends. With more than 5 million active users, TWINT is the leading payment app in Switzerland.",
    "googlepay": "Google Pay™ is a mobile wallet solution available to all the customers who have a Google account. To use this payment method, you must adhere to the Google Pay APIs Acceptable Use Policy and accept the terms that Google Pay API Terms of Service defines.",
    "paypal": "PayPal is globally one of the most popular online payment methods. Your customers are redirected to PayPal’s site to log in with their PayPal credentials and approve the payment. Once the authentication and payment is done, they can be redirected back to your online shop.",
    "payu": "PayU is an online bank transfer. It is one of the most popular payment methods amongst Polish consumers. Offering real-time bank transfer payments, PayU allows consumers to make payments for e-commerce purchases directly from their bank account. The consumer selects their preferred online bank and logs into their account to confirm the payment.",
    "post-finance-card": "PostFinance is an online direct payment method used by the Swiss customers for online payments. The currency is Swiss Franc (CHF).",
    "post-finance-efinance": "PostFinance is an online direct payment method used by the Swiss customers for online payments. The transaction currency is Swiss Franc (CHF).",
    "przelewy24": "Przelewy24 (P24) is one of the most popular online payment methods available in Poland. After selecting P24 the customer will be redirected to P24 to initiate an online transfer. P24 is acting as a payment initiation service and will enable the costumer to securely log in to their banks to authorize the payment. Once the authentication and payment are done, the customer can continue shopping in your online shop.",
    "sofort": "Sofort is a popular online payment method available in Germany and Austria. After selecting Sofort, the customer will be redirected to Sofort, a Klarna service, to initiate an online transfer. Sofort is acting as a payment initiation service and will enable the customer to securely log in to their bank to authorize the payment.",
    "paylater-direct-debit": "SEPA Direct Debit is a payment method available in the European SEPA region and based on the EU SEPA rule book. The customer only needs their IBAN for making a payment. Unzer will debit the amount from the customer’s account and transfer it to the merchant.",
    "direct-debit-secured": "Direct Debit Secured is a part of our Buy Now, Pay Later (BNPL) offering and it’s a very convenient payment option. This payment option offers customers an easy and secure way to shop online or in-store without having to manually perform payments. For merchants the BNPL payment options drive conversion and customer satisfaction.",
    "paylater-installment": "Unzer Installment is a part of our Buy Now, Pay Later (BNPL) offering and it’s a very convenient payment option. This payment option offers customers a flexible and secure way to shop online or in-store without having to pay upfront which limits the risks for customers. For merchants the BNPL payment options drive conversion and customer satisfaction.",
    "paylater-invoice": "Unzer Invoice is a part of our Buy Now Pay Later (BNPL) offering and it’s a convenient payment option. This payment option offers customers a flexible and secure way to shop online or in-store without having to pay upfront which limits the risks for customers.",
    "prepayment": "Prepayment is a safe and convenient payment method for merchants. The merchant ships their goods not until customers paid their order via bank transfer. Unzer offers to check for received funds and commence matching.",
    "wechatpay": "WeChat pay is a Chinese payment method tied to the most popular messaging service in China. Your customer pays via QR code using either the balance from their WeChat wallet or a bank account linked to the wallet."
  },
  "validation": {
    "requiredField": "This field is required.",
    "invalidField": "This field is invalid.",
    "invalidEmail": "This field must be a valid email.",
    "maxLength": "The field cannot have more than %s characters.",
    "numeric": "Value must be a valid number with max two decimals.",
    "greaterThanZero": "Value must be greater than 0.",
    "nonNegative": "Field cannot have a negative value.",
    "numberOfDecimalPlaces": "Field must have 2 decimal places.",
    "integer": "Field must be an integer.",
    "invalidNumberInList": "Each value must be a positive number.",
    "invalidWholeNumberInList": "Each value must be a positive whole number.",
    "duplicateNumberInList": "The list cannot contain duplicate values.",
    "invalidUrl": "Field must be a valid URL.",
    "invalidFieldValue": "Field must be set to \"%s\".",
    "invalidMaxValue": "Maximal allowed value is %s.",
    "invalidImageType": "Please provide a file in one of the supported image types (PNG, JPG).",
    "invalidFileType": "Please provide a file in one of the supported types (.doc, .docx, .xls, .xlsx, .txt, .pdf).",
    "invalidImageSize": "The selected file exceeds the limit of 10MB.",
    "passwordSize": "Password must be at least 8 characters long.",
    "passwordUppercase": "Password must contain at least one uppercase letter.",
    "passwordNumber": "Password must contain at least one number.",
    "passwordSpecial": "Password must contain at least one special character.",
    "passwordConfirm": "Passwords do not match.",
    "minGreaterThanMax": "The min order value is greater than max order value."
  }
}